In [20]:
import pandas as pd

data = pd.DataFrame({"character": ["Goku","Vegeta", "Nappa","Goku","Piccolo"], 
                   "power level": [12000, 16000, 4000, 12000, 3000]})

data

  character  power level
0      Goku        12000
1    Vegeta        16000
2     Nappa         4000
3      Goku        12000
4   Piccolo         3000

In [21]:
# Use df.drop_duplicates() to remove duplicate rows
data = data.drop_duplicates()

data

  character  power level
0      Goku        12000
1    Vegeta        16000
2     Nappa         4000
4   Piccolo         3000

In [22]:
data.drop_duplicates(inplace=True)

data

<ipython-input-22-9c10d86a3b29>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data.drop_duplicates(inplace=True)

  character  power level
0      Goku        12000
1    Vegeta        16000
2     Nappa         4000
4   Piccolo         3000